tests/flatMembrane/Allrun
#!/bin/sh
blockMesh
NMACFoam
